# словарь необходимый для зашифровки каждого элемента
encode = {
    'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.', 'Д': '-..', 'Е': '.', 'Ё': '.', 'Ж': '...-',
    'З': '--..', 'И': '..', 'Й': '.---', 'К': '-.-', 'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---',
    'П': '.--.', 'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-', 'Ф': '..-.', 'Х': '....', 'Ц': '-.-.',
    'Ч': '---.', 'Ш': '----', 'Щ': '--.-', 'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..',
    'Ю': '..--', 'Я': '.-.-', 'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.',
    'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.',
    'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-',
    'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..', '.': '.-.-.-', ',': '--..--',
    '?': '..--..', "\'": '.----.', '!': '-.-.--',
    '/': '-..-.', '(': '-.--.', ')': '-.--.-', '&': '.-...', ':': '---...',
    ';': '-.-.-.', '=': '-...-', '+': '.-.-.', '-': '-....-', '_': '..--.-',
    '"': '.-..-.', '$': '...-..-', '@': '.--.-.', '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
    '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.', ' ': ' '
}
# словарь необходимый для расшифровки каждого элемента
decode = {value: key for key, value in encode.items()}


def main():
    # функция для закодирования сообщения
    def encode_message(message):
        global encode
        return ''.join([encode[i.upper()] for i in message])

    # функция для декодирования сообщения
    def decode_message(message):
        global decode
        return ''.join([decode[i] for i in message])

    # приветствие пользователя
    print('Здравствуйте, хотите кодировать и декодировать сообщение?')
    print('1 - кодировать')
    print('2 - декодировать')
    answer = input()
    while answer not in '12':
        answer = input()

    # кодирование сообщения
    if answer == '1':
        print('Введите сообщение')
        print(encode_message(input()))
    # декадирование сообщения
    else:
        print('Введите сообщение')
        print(decode_message(input()))


main()
